/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_calloc.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: eklompus <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/10/30 11:44:35 by eklompus          #+#    #+#             */
/*   Updated: 2019/10/30 11:44:35 by eklompus         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
**	Выделяет блок памяти для массива размера count с размером
**	каждой ячейки size
** @param count - размер массива
** @param size - размер элемента массива
** @return указатель на выделенный блок памяти
*/

void	*ft_calloc(size_t count, size_t size)
{
	return (ft_memalloc(count * size));
}
